# YOLO11 multi-task model configuration file

# Parameters
nc: 6  # including one class for object detection, one class for instance segmentation, and four for pose estimation
kpt_shape: [4, 3]  # keypoints shape for pose estimation (4 keypoints, each with x,y,visibility)
channels: 3  # input channels (RGB)
scales: 
  # [depth, width, max_channels]
  n: [0.50, 0.25, 1024] # nano version
  s: [0.50, 0.50, 1024] # small version
  m: [0.50, 1.00, 512]  # medium version
  l: [1.00, 1.00, 512]  # large version
  x: [1.00, 1.50, 512]  # extra large version

# YOLO11 backbone 
backbone:
  # [from, repeats, module, args]
  # from: 输入来自哪一层 (-1表示前一层)
  # repeats: 重复次数
  # module: 使用的模块类型
  # args: 模块参数 [输出通道数, 卷积核大小, 步长]
  
  - [-1, 1, Conv, [64, 3, 2]]      # 0-P1/2: 输入→64通道，3×3卷积，步长2
  - [-1, 1, Conv, [128, 3, 2]]     # 1-P2/4: 64→128通道，3×3卷积，步长2
  - [-1, 2, C3k2, [256, False, 0.25]]  # 2: 128→256通道，C3k2模块重复2次
  - [-1, 1, Conv, [256, 3, 2]]     # 3-P3/8: 256→256通道，3×3卷积，步长2
  - [-1, 2, C3k2, [512, False, 0.25]]  # 4: 256→512通道，C3k2模块重复2次
  - [-1, 1, Conv, [512, 3, 2]]     # 5-P4/16: 512→512通道，3×3卷积，步长2
  - [-1, 2, C3k2, [512, True]]     # 6: 512→512通道，C3k2模块重复2次
  - [-1, 1, Conv, [1024, 3, 2]]    # 7-P5/32: 512→1024通道，3×3卷积，步长2
  - [-1, 2, C3k2, [1024, True]]    # 8: 1024→1024通道，C3k2模块重复2次
  - [-1, 1, SPPF, [1024, 5]]       # 9: 空间金字塔池化，核大小5
  - [-1, 2, C2PSA, [1024]]         # 10: 位置自注意力模块，重复2次

# Multi-task head 
head:
  # Neck部分：特征融合网络 (FPN-like structure)
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]  # 11: 上采样2倍
  - [[-1, 6], 1, Concat, [1]]       # 12: 连接第11层和第6层 (P4)
  - [-1, 2, C3k2, [512, False]]     # 13: 融合特征，输出512通道
  
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]  # 14: 再次上采样2倍
  - [[-1, 4], 1, Concat, [1]]       # 15: 连接第14层和第4层 (P3)
  - [-1, 2, C3k2, [256, False]]     # 16: 融合特征，输出256通道 (P3/8-small)

  - [-1, 1, Conv, [256, 3, 2]]      # 17: 下采样
  - [[-1, 13], 1, Concat, [1]]      # 18: 连接第17层和第13层
  - [-1, 2, C3k2, [512, False]]     # 19: 融合特征，输出512通道 (P4/16-medium)

  - [-1, 1, Conv, [512, 3, 2]]      # 20: 下采样
  - [[-1, 10], 1, Concat, [1]]      # 21: 连接第20层和第10层
  - [-1, 2, C3k2, [1024, True]]     # 22: 融合特征，输出1024通道 (P5/32-large)

  # Multi-task heads: 多个任务头
  - [[16, 19, 22], 1, Detect, [1]]          # 23: 检测头 (P3, P4, P5), one class(tomato_peduncle)
  - [[16, 19, 22], 1, Segment, [1, 32, 256]] # 24: 分割头 (P3, P4, P5), one_class(peduncle_mask)
  - [[16, 19, 22], 1, Pose, [4, kpt_shape]]  # 25: 姿态估计头 (P3, P4, P5), four keypoints (Mtop, Jp, Mbut, Pu)
